app/controllers/tweets_controller.rb

    def index
        @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets" WHERE (body LIKE '%今から%' )

    def create
        @tweet = Tweet.new(tweet_params)

        @tweet.user_id = current_user.id

        if @tweet.save
---
INSERT INTO "tweets" ("body", "created_at", "updated_at", "user_id", "image") VALUES (?, ?, ?, ?, ?)  [["body", "これおもろいよね！"], ["created_at", "2020-02-25 12:32:29.943525"], ["updated_at", "2020-02-25 12:32:29.943525"], ["user_id", 4], ["image", "69993115_2388538868059303_218781313321140224_o.jpg"]]

    def edit
        @tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @tweet = Tweet.find(params[:id])
        if @tweet.update(tweet_params)
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tweets" SET "body" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["body", "jitreoafe[ぢいいあ＠いお"], ["updated_at", "2020-02-13 01:53:37.234565"], ["id", 5]]

    def destroy
        Tweet.find(params[:id]).destroy
---
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 5]]
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]